import React from 'react';
import { Link } from 'react-router-dom';
import bannerImage from '../assets/Teal Illustration Digital Business Blog Banner.png';

const FrontPage = () => {
  return (
    <div className="front-page">
        <header>
            <div className="heroBanner">
                <img src={bannerImage}/>
            <div className="title">
            <h1>Индивидуални онлайн уроци по математика</h1>
            <h2>от @lesna.matematika</h2>
        </div>
            </div>

    </header>

    <section id="hero">
        <div className="hero-text">
            <h2>Индивидуални онлайн уроци по математика</h2>
            <p>Подгответе се за успех в математиката с индивидуално обучение, подходящо за ученици от 5 до 7 клас.</p>
            <a href="#contact" className="cta-button">Запишете се сега</a>
        </div>
    </section>

    <section id="about">
        <h2>За мен</h2>
        <p>Аз съм София, опитен учител по индивидуална математика на ученици от 5 до 7 клас. С индивидуален подход и иновативни методи, помагам на учениците да подобрят своите математически умения и увереност. <br/> <br/> Математиката ми е интересна от малка - в четвърти клас се явих на състезание без допълнителна подготовка и спечелих 2-ро място. Влязох в подготвителна паралелка 5-7 клас в Математическата във Варна, после в Американския Колеж в София - 8-12 клас, завърших бакалавър в Лийдс, работила съм 6 години в Англия като софтуерен инженер, в България се върнах 2020-та. Започнах да се занимавам с благотворителност извън работата си, посещавам детски домове с фондация "Подарете книга", където разбрах, че много ми допада да помагам на деца да превъзмогнат пропуските си. След това преподавах в друга фондация - "Добро за всеки", специално на седмокласници, които нямат възможност да си позволят частни уроци и са изостанали с материала. По този повод започнах да развивам и тикток акаунт (@lesna.matematika), за да мога да достигна до децата на тяхна територия и да им предоставя лесно смилаема информация, която да приемат, когато поискат. От там много деца ме потърсиха за индивидуални уроци.

Смея да кажа, че децата харесват да прекарват време с мен, учейки. Предлагам индивидуални уроци по математика за 5, 6 и 7 клас, като най-важното е за мен децата да разберат материала лесно, за да могат да го приложат сами и да не са изненадани на контролни, изпити и НВО. </p>
    </section>

    <section id="services">
        <h2>При мен можете да очаквате:</h2>
        <ul>
            <li>Индивидуални уроци</li>
            <li>Гъвкаво разписание</li>
            <li>Подготовка за контролни и изпити</li>
            <li>Подготовка за състезания</li>
        </ul>
    </section>

    <footer id="contact">
        <h2>Контакти</h2>
        <p>Свържете се с мен на <a href="tel:+359876330336"> 0876330336 </a> или <a href="mailto:lesnamatematika7@gmail.com">lesnamatematika7@gmail.com</a> за повече информация и записвания.</p>
    </footer>

    </div>
  );
}

export default FrontPage;